In [1]:
import pandas as pd

In [7]:
pd.Series([10,20,30], index=range(4,7))

4    10
5    20
6    30
dtype: int64

In [8]:
d = {'a': 20, 'b': 30, 'c': 40}

In [21]:
s = pd.Series([1,2,3,4,5,6])

In [28]:
print(s.describe(exclude=['mean']))

count    6.000000
mean     3.500000
std      1.870829
min      1.000000
25%      2.250000
50%      3.500000
75%      4.750000
max      6.000000
dtype: float64

In [32]:
sc = pd.Series(7, range(1,5))

In [33]:
sc

1    7
2    7
3    7
4    7
dtype: int64

In [321]:
list2 = [1,2,3,4,5,6,7]

In [322]:
pd.Series(list2, range(1,8))

1    1
2    2
3    3
4    4
5    5
6    6
7    7
dtype: int64

In [37]:
methods = pd.Series([sum, max, min])

In [56]:
import numpy as np

In [59]:
# Dynamic Calculator Using Pandas Series
# step 1: Define the Series of methods
operations = pd.Series({
    'sum': sum,
    'min': min,
    'mean': np.mean,
    'sqrt sum': lambda x: sum([i**2 for i in x])
})

data = [10,20,30,40,50,60,50]
user_input = 'mean'

if user_input in operations:
    result = operations[user_input](data)
    print(result)
else:
    print("Invalid input")

37.142857142857146

In [285]:
data = pd.Series([1,2,3,np.nan,5,6,7])

In [286]:
data

0    1.0
1    2.0
2    3.0
3    NaN
4    5.0
5    6.0
6    7.0
dtype: float64

In [287]:
data.fillna(data.sum)

0                                                  1.0
1                                                  2.0
2                                                  3.0
3    <bound method Series.sum of 0    1.0\n1    2.0...
4                                                  5.0
5                                                  6.0
6                                                  7.0
dtype: object

In [71]:
import pandas as pd

In [72]:
s = pd.Series([1,2,3,4,5])

In [75]:
print(s / 2)

0    0.5
1    1.0
2    1.5
3    2.0
4    2.5
dtype: float64

In [85]:
import numpy as np
import pandas as pd

data = pd.Series([1,2,3,4,5,6,7,8])
operations = pd.Series({
    'sum': sum,
    'max': max,
    'min': min,
    'mean': np.mean,
    'sqrt_sum': lambda x: x ** 2
})

choice = 'mean'
if choice in operations:
    print(operations[choice](data))
else:
    print("Wrong Choice")

4.5

In [291]:
x = np.random.seed(101)

None

In [292]:
np.random.randn(5,4)

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053],
       [ 0.18869531, -0.75887206, -0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732,  2.60596728,  0.68350889]])

In [91]:
print(x)

None

In [92]:
from numpy.random import randn

In [94]:
randn(5,4)

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053],
       [ 0.18869531, -0.75887206, -0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732,  2.60596728,  0.68350889]])

In [105]:
from numpy.random import randint

In [111]:
randint(400)

362

In [293]:
np.random.seed(101)
df = pd.DataFrame((randn(5,4) * 10).astype(int), ['A', 'B', 'C', 'D', 'E'], ['W', 'X', 'Y', 'Z'])

In [294]:
df

    W   X   Y  Z
A  27   6   9  5
B   6  -3  -8  6
C -20   7   5 -5
D   1  -7  -9  9
E   1  19  26  6

In [139]:
df.iloc[0:1]

    W  X  Y  Z
A  27  6  9  5

In [143]:
df.iloc[0,1]

np.int64(6)

In [144]:
df.W

A    27
B     6
C   -20
D     1
E     1
Name: W, dtype: int64

In [299]:
df['new'] = df.sum(axis=1)

In [300]:
df

    W   X   Y  Z   new
A  27   6   9  5  47.0
B   6  -3  -8  6   1.0
C -20   7   5 -5 -13.0
D   1  -7  -9  9  -6.0
E   1  19  26  6  52.0

In [22]:
df['sum'] = df.sum(axis=1)

In [176]:
df['V'] = df.sum(axis= 0)

In [23]:
df

        U   W   X   Y   Z  sum
index
A      10  53  86  45  56  500
B      31  19  14  81  62  414
C      38  31   9  45  76  398
D      91  16  41  95  95  676

In [187]:
df.drop('sum', axis= 1, inplace=True)

In [188]:
df

    W   X   Y  Z    new
A  27   6   9  5  141.0
B   6  -3  -8  6    3.0
C -20   7   5 -5  -39.0
D   1  -7  -9  9  -18.0
E   1  19  26  6  156.0

In [193]:
df.drop('E', axis=0, inplace=True)

In [194]:
df

    W  X  Y  Z    new
A  27  6  9  5  141.0
B   6 -3 -8  6    3.0
C -20  7  5 -5  -39.0
D   1 -7 -9  9  -18.0

In [195]:
df.shape

(4, 5)

In [198]:
df.loc[['A', 'B']]

    W  X  Y  Z    new
A  27  6  9  5  141.0
B   6 -3 -8  6    3.0

In [204]:
df.loc['F'] = df.sum(axis=0)

In [205]:
df

      W    X    Y     Z    new
A  27.0  6.0  9.0   5.0  141.0
B   6.0 -3.0 -8.0   6.0    3.0
C -20.0  7.0  5.0  -5.0  -39.0
D   1.0 -7.0 -9.0   9.0  -18.0
E  47.0  6.0 -2.0  26.0  231.0
F  61.0  9.0 -5.0  41.0  318.0

In [215]:
df.loc[['A', 'B'], ['X','Y']] > 5

       X      Y
A   True   True
B  False  False

In [217]:
bool = df > 20

In [218]:
df[bool]

      W   X   Y     Z    new
A  27.0 NaN NaN   NaN  141.0
B   NaN NaN NaN   NaN    NaN
C   NaN NaN NaN   NaN    NaN
D   NaN NaN NaN   NaN    NaN
E  47.0 NaN NaN  26.0  231.0
F  61.0 NaN NaN  41.0  318.0

In [301]:
from numpy.random import randn
(randn(5,4) * 10).astype(int)

array([[  3,  16, -17, -11],
       [ -1,   3,   1,   1],
       [  8,   0,   6,   3],
       [ -4,  -7,  -9,   4],
       [ -1,  19,   2,  19]])

In [225]:
np.random.randint(100, size = (5,5))

array([[21, 81, 23, 94, 71],
       [20, 27, 75,  5, 49],
       [86, 89, 63, 82, 77],
       [ 3, 56, 14, 49, 87],
       [52, 13, 47, 49, 24]])

In [230]:
df = pd.DataFrame(randn(5,4), ['A','B','C','D','E'], ['X','Y','Z','W'])

In [245]:
df[df['Y'] > 0][['Y', 'Z']]

          Y         Z
B  0.992552 -0.776338
C  0.576822 -0.718524
D  1.873917 -0.448642

In [244]:
df['Y'] > 0

A    False
B     True
C     True
D     True
E    False
Name: Y, dtype: bool

In [251]:
df[(df['Y'] > 0) & (df['W'] > 0)]

          X         Y         Z         W
B -1.518414  0.992552 -0.776338  0.274041

In [253]:
my_data = {
    'Name': ["Kishore", "Sudeshna", "Arjun", "Ayansh"],
    'Age' : [38, 34, 7, 3],
    'City': ['Vijayawada', 'Kurnool', 'Vijayawda', 'Kurnool']
}
data = pd.DataFrame(my_data)
data

       Name  Age        City
0   Kishore   38  Vijayawada
1  Sudeshna   34     Kurnool
2     Arjun    7   Vijayawda
3    Ayansh    3     Kurnool

In [260]:
data2 = data.set_index('Name')

In [276]:
data2.groupby('City')['Age'].mean

In [279]:
Districts = ['Krishna', 'Kurnool', 'Krishna', 'Kurnool']
data['Districts'] = Districts

In [282]:
data.set_index('Age')

         Name        City Districts
Age
38    Kishore  Vijayawada   Krishna
34   Sudeshna     Kurnool   Kurnool
7       Arjun   Vijayawda   Krishna
3      Ayansh     Kurnool   Kurnool

In [302]:
#Practice after gap

In [306]:
from numpy.random import randint
new_df = pd.DataFrame(randint(100, size=(4,4)), ['A', 'B', 'C', 'D'], ['W', 'X', 'Y', 'Z'])

In [307]:
new_df

    W   X   Y   Z
A  47  14  69  60
B  69  51   6  88
C  71  68  23  35
D  79  98  67  82

In [313]:
new_df[['W', 'Y']]

    W   Y
A  47  69
B  69   6
C  71  23
D  79  67

In [315]:
new_df.loc['A']

W    47
X    14
Y    69
Z    60
Name: A, dtype: int64

In [4]:
import numpy as np
import pandas as pd

In [5]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [6]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [8]:
from numpy.random import randn

In [14]:
df = pd.DataFrame((randn(6,2) * 10).astype(int), hier_index, ['A', 'B'])

In [15]:
df

       A   B
G1 1  -1  -9
   2  25 -19
   3   1  15
G2 1   4   7
   2  -4   6
   3  11  -6

In [24]:
df.loc['G2'].loc[1:1]

   A  B
1  4  7

In [34]:
df

       A   B
G1 1  -1  -9
   2  25 -19
   3   1  15
G2 1   4   7
   2  -4   6
   3  11  -6

In [39]:
df.index.names = ['Groups', 'Num']

In [40]:
df

             A   B
Groups Num
G1     1    -1  -9
       2    25 -19
       3     1  15
G2     1     4   7
       2    -4   6
       3    11  -6

In [52]:
df.loc['G2'].loc[2].B

np.int64(6)

In [62]:
df.xs(1, level='Num')

        A  B
Groups
G1     -1 -9
G2      4  7

In [2]:
import numpy as np
import pandas as pd

In [4]:
from  numpy.random import randint

In [8]:
df = pd.DataFrame(randint(100, size=(4, 5)), ['A', 'B', 'C', 'D'], ['U', 'W', 'X', 'Y', 'Z'])

In [11]:
df.index.names = ["index"]

In [12]:
df

        U   W   X   Y   Z
index
A      10  53  86  45  56
B      31  19  14  81  62
C      38  31   9  45  76
D      91  16  41  95  95

In [20]:
int(df.loc['A']['W'])

53

In [24]:
d = {'A': [5, 6, np.nan], 'B':[4, np.nan, np.nan], 'C': [1,2,3]}

In [25]:
data = pd.DataFrame(d)

In [28]:
data

     A    B  C
0  5.0  4.0  1
1  6.0  NaN  2
2  NaN  NaN  3

In [30]:
data.dropna(thresh=2, axis=1)

     A  C
0  5.0  1
1  6.0  2
2  NaN  3

In [35]:
data['B'].fillna(data['B'].mean())

0    4.0
1    4.0
2    4.0
Name: B, dtype: float64

In [47]:
data = {'Company':['GOOG','GOOG','GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','kishore','Jai','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,500,600,340,124,243,350]}

In [48]:
df = pd.DataFrame(data)

In [42]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [60]:
df.groupby('Company').mean(numeric_only=True)

         Sales
Company
FB       296.5
GOOG     355.0
MSFT     232.0

In [63]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    4.000000    2.000000
      mean   296.500000  355.000000  232.000000
      std     75.660426  231.156513  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  180.000000  178.000000
      50%    296.500000  350.000000  232.000000
      75%    323.250000  525.000000  286.000000
      max    350.000000  600.000000  340.000000

In [78]:
import pandas as pd

customers = pd.DataFrame({
    'cust_id':[1,2,3],
    'name':['Kishore','Ayansh','Arjun'],
    'segment':['Pro','Pro','Basic']
})
orders = pd.DataFrame({
    'order_id':[101,102,103,104],
    'cust_id':[1,1,2,4],
    'amount':[250, 400, 150, 999]
})

In [85]:
pd.merge(customers, orders, how='left', on='cust_id', indicator=True)

   cust_id     name segment  order_id  amount     _merge
0        1  Kishore     Pro     101.0   250.0       both
1        1  Kishore     Pro     102.0   400.0       both
2        2   Ayansh     Pro     103.0   150.0       both
3        3    Arjun   Basic       NaN     NaN  left_only

In [83]:
pd.merge(customers, orders, how='right', on='cust_id')

   cust_id     name segment  order_id  amount
0        1  Kishore     Pro       101     250
1        1  Kishore     Pro       102     400
2        2   Ayansh     Pro       103     150
3        4      NaN     NaN       104     999

In [84]:
pd.merge(customers, orders, how='inner', on='cust_id')

   cust_id     name segment  order_id  amount
0        1  Kishore     Pro       101     250
1        1  Kishore     Pro       102     400
2        2   Ayansh     Pro       103     150

In [90]:
pd.merge(customers, orders, how='outer', on='cust_id')

   cust_id     name segment  order_id  amount
0        1  Kishore     Pro     101.0   250.0
1        1  Kishore     Pro     102.0   400.0
2        2   Ayansh     Pro     103.0   150.0
3        3    Arjun   Basic       NaN     NaN
4        4      NaN     NaN     104.0   999.0

In [98]:
erp = pd.DataFrame({'id':[1,2], 'revenue':[1000, 1200]})
pd.merge(customers, erp, left_on='cust_id', right_on='id', how='left').drop(columns='id').fillna(value=0)

   cust_id     name segment  revenue
0        1  Kishore     Pro   1000.0
1        2   Ayansh     Pro   1200.0
2        3    Arjun   Basic      0.0

In [99]:
slo = orders.set_index('order_id')

In [103]:
sla = pd.DataFrame({'order_id':[101,102,104],
                    'sla_hours':[24,24,12]}).set_index('order_id')

In [104]:
sla

          sla_hours
order_id
101              24
102              24
104              12

In [105]:
slo.merge(sla, left_index=True, right_index=True, how='left')

          cust_id  amount  sla_hours
order_id
101             1     250       24.0
102             1     400       24.0
103             2     150        NaN
104             4     999       12.0

In [106]:
A = pd.DataFrame({'key':['X','X','Y'], 'v1':[1,2,3]})
B = pd.DataFrame({'key':['X','X','Y'], 'v2':['a','b','c']})
pd.merge(A, B, on='key', how='inner', validate='m:m')  # cartesian per key

  key  v1 v2
0   X   1  a
1   X   1  b
2   X   2  a
3   X   2  b
4   Y   3  c

In [111]:
# Index-based
left = customers.set_index('cust_id')
right = orders.groupby('cust_id')['amount'].sum().to_frame('total_spend')
left.join(right, how='outer')

            name segment  total_spend
cust_id
1        Kishore     Pro        650.0
2         Ayansh     Pro        150.0
3          Arjun   Basic          NaN
4            NaN     NaN        999.0

In [109]:
right

         total_spend
cust_id
1                650
2                150
4                999

In [112]:
jan = pd.DataFrame({'order_id':[1,2], 'amount':[100,200]})
feb = pd.DataFrame({'order_id':[3],   'amount':[180]})
all_orders = pd.concat([jan, feb], axis=0, ignore_index=True)

In [113]:
all_orders

   order_id  amount
0         1     100
1         2     200
2         3     180

In [114]:
a = pd.DataFrame({'id':[1,2], 'A':[10,20]})
b = pd.DataFrame({'id':[3],   'B':[99]})
pd.concat([a,b], ignore_index=True, sort=False)

   id     A     B
0   1  10.0   NaN
1   2  20.0   NaN
2   3   NaN  99.0

In [115]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [119]:
df['col2'].nunique()

3

In [126]:
df['col2'].value_counts() == 1

col2
444    False
555     True
666     True
Name: count, dtype: bool

In [129]:
df.drop_duplicates(subset=['col2'], keep='last')

   col1  col2 col3
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [136]:
unique_df = []
temp = set()
for index, row in df.iterrows():
    key = row['col2']
    if key not in temp: 
        temp.add(key)
        unique_df.append(row)
print(pd.DataFrame(unique_df))

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi

In [143]:
df['col1'].apply(lambda x: x ** 2)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [154]:
df.index.names = ['ki']

In [155]:
df

    col1  col2 col3
ki
0      1   444  abc
1      2   555  def
2      3   666  ghi
3      4   444  xyz

In [161]:
df.sort_values(by='col2')

    col1  col2 col3
ki
0      1   444  abc
3      4   444  xyz
1      2   555  def
2      3   666  ghi

In [160]:
df.sort_index()

    col1  col2 col3
ki
0      1   444  abc
1      2   555  def
2      3   666  ghi
3      4   444  xyz

In [166]:
import pandas as pd

df = pd.DataFrame({
    'Company': ['GOOG','GOOG','MSFT','MSFT','FB','FB','FB'],
    'Person': ['Kishore','Ayansh','Arjun','Sam','Amy','Carl','Sarah'],
    'Department': ['Sales','Sales','HR','HR','Sales','HR','HR'],
    'Sales': [200, 250, 120, 340, 243, 301, 180]
})

In [174]:
df.pivot_table(values='Sales', index=['Company'], columns=['Department'], fill_value=0, aggfunc=['mean', 'sum'])

             mean         sum
Department     HR  Sales   HR Sales
Company
FB          240.5  243.0  481   243
GOOG          0.0  225.0    0   450
MSFT        230.0    0.0  460     0

In [190]:
df.loc[df.groupby('Company')['Sales'].idxmax(), ['Company', 'Person', 'Sales']]

  Company  Person  Sales
5      FB    Carl    301
1    GOOG  Ayansh    250
3    MSFT     Sam    340

In [194]:
df.loc[df.groupby('Company')['Sales'].idxmax()]

  Company  Person Department  Sales
5      FB    Carl         HR    301
1    GOOG  Ayansh      Sales    250
3    MSFT     Sam         HR    340

In [195]:
#Find each companys employee with the maximum Sales and print the Company, Employee, and Sales.
import pandas as pd

df = pd.DataFrame({
    'Company': ['TCS','TCS','Infosys','Infosys','Wipro','Wipro','Wipro'],
    'Employee': ['Kishore','Ayansh','Arjun','Sam','Amy','Carl','Sarah'],
    'Sales': [500, 800, 300, 700, 650, 900, 400]
})

In [201]:
df.loc[df.groupby('Company')['Sales'].idxmax()]

   Company Employee  Sales
3  Infosys      Sam    700
1      TCS   Ayansh    800
5    Wipro     Carl    900

In [212]:
# Create a pivot table showing average Salary for each Dept and Gender.
# Add a total (grand total) for rows and columns.
data = pd.DataFrame({
    'Dept': ['IT','IT','HR','HR','Finance','Finance','IT','HR'],
    'Gender': ['M','F','M','F','M','F','M','F'],
    'Salary': [90000,85000,75000,70000,88000,83000,95000,72000]
})
data.pivot_table(values='Salary', index='Dept', columns='Gender', margins=True)

Gender         F        M           All
Dept
Finance  83000.0  88000.0  85500.000000
HR       71000.0  75000.0  72333.333333
IT       85000.0  92500.0  90000.000000
All      77500.0  87000.0  82250.000000

In [220]:
#Remove Duplicates Without Using drop_duplicates()
df = pd.DataFrame({
    'EmpID':[1,2,3,4,5,6],
    'Email':['a@gmail.com','b@gmail.com','a@gmail.com','c@gmail.com','b@gmail.com','d@gmail.com']
})
def remove_duplicates(data):
    unique_df = []
    temp = set()

    for index, row in df.iterrows():
        key = row['Email']
        if key not in temp:
            temp.add(key)
            unique_df.append(row)
    return pd.DataFrame(unique_df)
    
print(remove_duplicates(df))

   EmpID        Email
0      1  a@gmail.com
1      2  b@gmail.com
3      4  c@gmail.com
5      6  d@gmail.com

In [223]:
#Total & Average Sales by Region
sales = pd.DataFrame({
    'Region':['East','West','East','North','South','South','West','East'],
    'Month':['Jan','Jan','Feb','Feb','Jan','Feb','Feb','Mar'],
    'Revenue':[200,250,300,180,400,420,150,500]
})
sales.pivot_table(values='Revenue', index='Region', aggfunc=['sum', 'mean'])

           sum        mean
       Revenue     Revenue
Region
East      1000  333.333333
North      180  180.000000
South      820  410.000000
West       400  200.000000

In [245]:
#Filter products where Discount > 10 and Price > 150.

#Sort the result by Price (descending).

data = pd.DataFrame({
    'Product':['A','B','C','D','E','F'],
    'Price':[100,200,150,180,300,120],
    'Discount':[10,15,20,5,25,10]
})
data[(data['Discount'] > 10) & (data['Price'] > 150)].sort_values(by='Price', ascending=False)

  Product  Price  Discount
4       E    300        25
1       B    200        15

In [258]:
orders = pd.DataFrame({
    'Store':['A','A','B','B','C','C','C'],
    'Month':['Jan','Feb','Jan','Feb','Jan','Feb','Mar'],
    'Sales':[200,300,400,500,600,700,800]
})
# Task:
#  For each store, show:

# Total Sales

# Average Sales

# Month with Maximum Sales

agg_basic = orders.groupby('Store')['Sales'].agg(total='sum', average='mean')

print(agg_basic)
# month with max sales per store
max_rows = orders.loc[orders.groupby('Store')['Sales'].idxmax(), ['Store','Month']]

print(max_rows)
result = agg_basic.merge(max_rows, on='Store') \
                  .rename(columns={'Month': 'month_with_max'}) \
                  .reset_index()
print(result)

       total  average
Store
A        500    250.0
B        900    450.0
C       2100    700.0
  Store Month
1     A   Feb
3     B   Feb
6     C   Mar
   index Store  total  average month_with_max
0      0     A    500    250.0            Feb
1      1     B    900    450.0            Feb
2      2     C   2100    700.0            Mar

In [259]:
pwd

'/Users/kishorecheruku/Downloads/Refactored_Py_DS_ML_Bootcamp-master/anaconda_projects/65ecb4e1-78cf-42ed-ac4d-d6340c421f50'

In [288]:
df = pd.read_csv('example')

In [289]:
df['sum'] = df.sum(axis= 1)

In [291]:
df.to_csv('My_output', index= False)

In [292]:
pd.read_csv('My_output')

    a   b   c   d  sum
0   0   1   2   3    6
1   4   5   6   7   22
2   8   9  10  11   38
3  12  13  14  15   54

In [296]:
pd.read_excel('Excel_Sample.xlsx', sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [297]:
sal = pd.read_csv('Salaries.csv')

In [306]:
float(sal['BasePay'].mean())

66325.4488404877

In [307]:
sal['OvertimePay'].max()

245131.88

In [312]:
sal[sal['EmployeeName'] == 'JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

In [337]:
sal.loc[sal['TotalPayBenefits'].idxmax()]

Id                                                               1
EmployeeName                                        NATHANIEL FORD
JobTitle            GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY
BasePay                                                  167411.18
OvertimePay                                                    0.0
OtherPay                                                 400184.25
Benefits                                                       NaN
TotalPay                                                 567595.43
TotalPayBenefits                                         567595.43
Year                                                          2011
Notes                                                          NaN
Agency                                               San Francisco
Status                                                         NaN
Name: 0, dtype: object

In [301]:
sal.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [313]:
sal[sal['EmployeeName'] == 'JOSEPH DRISCOLL']['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

In [349]:
#** What was the average (mean) BasePay of all employees per year? (2011-2014) ? **
sal.groupby(['Year'])['BasePay'].mean()

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

In [355]:
sal['JobTitle'].unique().size

2159

In [386]:
sal['JobTitle'].value_counts().head(5)

JobTitle
Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: count, dtype: int64

In [409]:
# ** How many Job Titles were represented by only one person in 2013? (e.g. Job Titles with only one occurence in 2013?) **
job_year = sal[sal['Year'] == 2013]
job_count = job_year['JobTitle'].value_counts()
len(job_count[job_count == 1])

202

In [430]:
# ** How many people have the word Chief in their job title? (This is pretty tricky) **

# sal[sal['JobTitle'].str.contains('Chief')].sum()

# sal[sal['JobTitle'].str.contains('Chief', case=False, na=False)].sum()

sal[sal['JobTitle'].str.contains('Chief')].shape[0]

423

In [433]:
sal['title_len'] = sal['JobTitle'].apply(len)

sal[['title_len', 'TotalPayBenefits']].corr()

                  title_len  TotalPayBenefits
title_len          1.000000         -0.036878
TotalPayBenefits  -0.036878          1.000000

In [439]:
sal['title_len'] = sal['JobTitle'].apply(len)
sal[['TotalPayBenefits', 'title_len']].corr()

                  TotalPayBenefits  title_len
TotalPayBenefits          1.000000  -0.036878
title_len                -0.036878   1.000000

In [448]:
def correlation(list1, list2):
    mean1 = list1.mean()
    mean2 = list2.mean()
    numerator = 0
    sum_x_sq = 0
    sum_y_sq = 0
    for i in range(0, len(list1)):
        x = list1[i] - mean1
        y = list2[i] - mean2
        
        numerator += x * y            #  (x - mean_x)(y - mean_y)
        sum_x_sq += x ** 2            #  (x - mean_x)^2
        sum_y_sq += y ** 2            #  (y - mean_y)^2
    
    denominator = (sum_x_sq * sum_y_sq) ** 0.5
    r = numerator / denominator
    print(r)

In [452]:
import pandas as pd

hours = pd.Series([40,45,35,50,30,42])
scores = pd.Series([88,92,80,95,78,85])

correlation(hours, scores)

0.9600493078121375

In [454]:
import pandas as pd
ecom = pd.read_csv('Ecommerce Purchases')

In [456]:
ecom.head()

,Address,Lot,AM or PM,Browser Info,Company,Credit Card,CC Exp Date,CC Security Code,CC Provider,Email,Job,IP Address,Language,Purchase Price
0,"16629 Pace Camp Apt. 448\nAlexisborough, NE 77...",46 in,PM,Opera/9.56.(X11; Linux x86_64; sl-SI) Presto/2...,Martinez-Herman,6011929061123406,02/20,900,JCB 16 digit,pdunlap@yahoo.com,"Scientist, product/process development",149.146.147.205,el,98.14
1,"9374 Jasmine Spurs Suite 508\nSouth John, TN 8...",28 rn,PM,Opera/8.93.(Windows 98; Win 9x 4.90; en-US) Pr...,"Fletcher, Richards and Whitaker",3337758169645356,11/18,561,Mastercard,anthony41@reed.com,Drilling engineer,15.160.41.51,fr,70.73
2,Unit 0065 Box 5052\nDPO AP 27450,94 vE,PM,Mozilla/5.0 (compatible; MSIE 9.0; Windows NT ...,"Simpson, Williams and Pham",675957666125,08/19,699,JCB 16 digit,amymiller@morales-harrison.com,Customer service manager,132.207.160.22,de,0.95
3,"7780 Julia Fords\nNew Stacy, WA 45798",36 vm,PM,Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_0 ...,"Williams, Marshall and Buchanan",6011578504430710,02/24,384,Discover,brent16@olson-robinson.info,Drilling engineer,30.250.74.19,es,78.04
4,"23012 Munoz Drive Suite 337\nNew Cynthia, TX 5...",20 IE,AM,Opera/9.58.(X11; Linux x86_64; it-IT) Presto/2...,"Brown, Watson and Andrews",6011456623207998,10/25,678,Diners Club / Carte Blanche,christopherwright@gmail.com,Fine artist,24.140.33.94,es,77.82

In [524]:
#** Hard: What are the top 5 most popular email providers/hosts (e.g. gmail.com, yahoo.com, etc...) **
ecom['Email'].str.split('@').str[1].value_counts().head(5)

Email
hotmail.com     1638
yahoo.com       1616
gmail.com       1605
smith.com         42
williams.com      37
Name: count, dtype: int64

In [479]:
#** What are the 5 most common Job Titles? **
ecom['Job'].value_counts().head(5)

Job
Interior and spatial designer    31
Lawyer                           30
Social researcher                28
Purchasing manager               27
Designer, jewellery              27
Name: count, dtype: int64

In [481]:
# ** Someone made a purchase that came from Lot: "90 WT" , what was the Purchase Price for this transaction? **
ecom[ecom['Lot'] == '90 WT']['Purchase Price']

513    75.1
Name: Purchase Price, dtype: float64

In [485]:
# ** What is the email of the person with the following Credit Card Number: 4926535242672853 **
ecom.loc[ecom['Credit Card'] == 4926535242672853, 'Email']

1234    bondellen@williams-garza.com
Name: Email, dtype: object

In [491]:
#** How many people have American Express as their Credit Card Provider and made a purchase above $95 ?**
ecom.loc[(ecom['CC Provider'] == 'American Express') & (ecom['Purchase Price'] > 95)].shape[0]

39

In [498]:
# ** Hard: How many people have a credit card that expires in 2025? **
def count_expire_25(cc_exp):
    year = cc_exp.split('/')[1]
    return year == '25'
ecom['CC Exp Date'].apply(count_expire_25).sum()

np.int64(1033)

In [506]:
ecom['CC Exp Date'].str[-2:].eq('25').sum()

np.int64(1033)

In [ ]:
#** Hard: What are the top 5 most popular email providers/hosts (e.g. gmail.com, yahoo.com, etc...) **

In [462]:
# ** How many rows and columns are there? **

In [459]:
# ** What is the average Purchase Price? **
ecom['Purchase Price'].mean()

np.float64(50.347302)

In [461]:
# ** What were the highest and lowest purchase prices? **
ecom['Purchase Price'].min()

0.0

In [471]:
# ** How many people have English 'en' as their Language of choice on the website? **
(ecom['Language'] == 'en').sum()

np.int64(1098)

In [ ]:
# ** How many people have the job title of "Lawyer" ? **

In [476]:
ecom[ecom['Job'] == 'Lawyer'].count()

Address             30
Lot                 30
AM or PM            30
Browser Info        30
Company             30
Credit Card         30
CC Exp Date         30
CC Security Code    30
CC Provider         30
Email               30
Job                 30
IP Address          30
Language            30
Purchase Price      30
dtype: int64

In [477]:
#** How many people made the purchase during the AM and how many people made the purchase during PM ? **

#**(Hint: Check out [value_counts()](http://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.value_counts.html) ) **
ecom['AM or PM'].value_counts()

AM or PM
PM    5068
AM    4932
Name: count, dtype: int64